Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Combs and the Int construction                                                         :post:
:PROPERTIES:
:TITLE: Combs and the Int construction
:EXPORT_FILE_NAME: combsint.html
:EXPORT_DATE: 5th November 2019
:INDEX_DATE: <2019-11-05 Tue>
:END:

After seeing my MSc colleague Daphne Wang working on [[https://arxiv.org/pdf/1701.04732.pdf][Kissinger and
Uiljen]]'s /combs/ for the whole term, I realized at [[https://twitter.com/mroman42/status/1178776527279988736][some point]] that these
were lenses in a compact closed category.  The proof goes as follows.

#+BEGIN_SRC haskell
 ∫ᵂ (A → W ⊗ B)×(C ⊗ W → D)
≅ ⟨ Duals ⟩
 ∫ᵂ (A → W ⊗ B)×(W → C* ⊗ D)
≅ ⟨ Yoneda ⟩
 A → (C* ⊗ D) ⊗ B
≅ ⟨ Duals, Symmetry ⟩
 I → A* ⊗ B ⊗ C* ⊗ D
#+END_SRC

The same proof can be used to show that Int(C)≅Optic(C) when C is
compact closed. Here ~Int~ is the [[https://arxiv.org/abs/1904.11287][Int construction]].

In the general case, after a suggestion by Jules that came from a
tweet by Piedeleu; Elena Di Lavore and me wrote down an explicit
Optic(C)→Int(C) embedding.

 * [[./opticint.pdf][Optic embeds into the Int construction]].

