combsint.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-05 Tue 13:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Combs and the Int construction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Combs and the Int construction</h1>
<p>
After seeing my MSc colleague Daphne Wang working on <a href="https://arxiv.org/pdf/1701.04732.pdf">Kissinger and
Uiljen</a>'s <i>combs</i> for the whole term, I realized at <a href="https://twitter.com/mroman42/status/1178776527279988736">some point</a> that these
were lenses in a compact closed category.  The proof goes as follows.
</p>

<div class="org-src-container">
<pre class="src src-haskell"> <span style="color: #7590db;">&#8747;</span>&#7490; <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #ce537a; font-weight: bold;">W</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">B</span><span style="color: #4f97d7;">)</span><span style="color: #7590db;">&#215;</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">C</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">W</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #ce537a; font-weight: bold;">D</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">&#8773;</span> <span style="color: #4f97d7;">&#10216;</span> <span style="color: #ce537a; font-weight: bold;">Duals</span> <span style="color: #4f97d7;">&#10217;</span>
 <span style="color: #7590db;">&#8747;</span>&#7490; <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #ce537a; font-weight: bold;">W</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">B</span><span style="color: #4f97d7;">)</span><span style="color: #7590db;">&#215;</span><span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">W</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #7590db;">*</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">D</span><span style="color: #4f97d7;">)</span>
<span style="color: #7590db;">&#8773;</span> <span style="color: #4f97d7;">&#10216;</span> <span style="color: #ce537a; font-weight: bold;">Yoneda</span> <span style="color: #4f97d7;">&#10217;</span>
 <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #4f97d7;">(</span><span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #7590db;">*</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">D</span><span style="color: #4f97d7;">)</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">B</span>
<span style="color: #7590db;">&#8773;</span> <span style="color: #4f97d7;">&#10216;</span> <span style="color: #ce537a; font-weight: bold;">Duals</span>, symmetry <span style="color: #4f97d7;">&#10217;</span>
 <span style="color: #ce537a; font-weight: bold;">I</span> <span style="color: #7590db;">&#8594;</span> <span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #7590db;">*</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">B</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">C</span><span style="color: #7590db;">*</span> <span style="color: #7590db;">&#8855;</span> <span style="color: #ce537a; font-weight: bold;">D</span>
</pre>
</div>

<p>
The same proof can be used to show that Int(C)≅Optic(C) when C is
compact closed. Here <code>Int</code> is the <a href="https://arxiv.org/abs/1904.11287">Int construction</a>.
</p>

<p>
In the general case, after a suggestion by Jules that came from a
tweet by Piedeleu; Elena Di Lavore and me wrote down an explicit
Optic(C)→Int(C) embedding.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 5th November 2019. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
